---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs.BeforeSaveToCentral
source: html/88c6bc2d-aaa4-a2fe-7b0b-a062f7d96c52.htm
---
# Autodesk.Revit.DB.Events.DocumentSaveToLocalProgressChangedEventArgs.BeforeSaveToCentral Property

True if the "save to local" operation is occurring before "save to central"; false if after.

## Syntax (C#)
```csharp
public bool BeforeSaveToCentral { get; }
```